# BuiltInFailures.CreationFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures Class
BuiltInFailures Class Members See Also
---
Failures about CreationFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class CreationFailures
```

Visual Basic
---
```text
Public NotInheritable Class CreationFailures
```

Visual C++
---
```text
public ref class CreationFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..CreationFailures
# See Also
BuiltInFailures..::..CreationFailures Members
Autodesk.Revit.DB Namespace